{
  "project": "OpenCode",
  "branchName": "ralph/tui-shift-enter-newline",
  "description": "TUI Input Box Shift+Enter Newline Support - Enable reliable newline insertion in the TUI input box via Shift+Enter (in supported terminals) and Ctrl+J (universal fallback)",
  "userStories": [
    {
      "id": "US-001",
      "title": "Diagnose terminal Shift+Enter support",
      "description": "As a developer, I need to understand why Shift+Enter and Cmd+Enter are not working in the TUI, so that I can determine the correct fix strategy.",
      "acceptanceCriteria": [
        "Add temporary debug logging in the textarea key handler (packages/opencode/src/cli/cmd/tui/component/prompt/index.tsx or textarea-keybindings.ts) to log ParsedKey fields (name, ctrl, shift, meta, super) for every keypress",
        "Document findings: what ParsedKey fields are received for Enter, Shift+Enter, Ctrl+Enter, Cmd+Enter, and Ctrl+J",
        "Confirm whether the terminal sends shift:true for Shift+Enter or treats it identically to plain Enter",
        "Write findings as comments in a new file packages/opencode/src/cli/cmd/tui/component/KEYBINDING-DIAGNOSIS.md",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "This is a diagnostic story. The debug logging should be added temporarily to understand the terminal behavior. The key question: does OpenTUI's ParsedKey distinguish Shift+Enter from Enter? If not, the issue is at the terminal emulator level."
    },
    {
      "id": "US-002",
      "title": "Verify config-driven keybindings register correctly in OpenTUI",
      "description": "As a developer, I want to verify that the config-driven keybindings for input_submit and input_newline are correctly registered in OpenTUI's KeyBinding map, so that the config system works as designed.",
      "acceptanceCriteria": [
        "Confirm mapTextareaKeybindings in textarea-keybindings.ts generates correct KeyBinding entries for both 'submit' and 'newline' actions",
        "Confirm the hardcoded entries { name: 'return', action: 'submit' } and { name: 'return', meta: true, action: 'newline' } are preserved as fallbacks",
        "Confirm config-driven bindings are appended AFTER hardcoded entries so they override via OpenTUI's last-write-wins merge strategy",
        "Add a unit test in a new test file packages/opencode/test/tui/textarea-keybindings.test.ts that verifies useTextareaKeybindings returns the expected keybinding array containing both hardcoded and config-driven entries",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Depends on US-001 findings. The current code already has config defaults input_newline='shift+return,ctrl+return,alt+return,ctrl+j' in config.ts. This story verifies they flow through correctly."
    },
    {
      "id": "US-003",
      "title": "Ensure Shift+Enter inserts newline in supported terminals",
      "description": "As a user using a modern terminal (Kitty, WezTerm, iTerm2 with CSI u mode), I want Shift+Enter to insert a newline in the TUI input box, so that I can compose multiline prompts.",
      "acceptanceCriteria": [
        "In terminals that distinguish Shift+Enter, pressing Shift+Enter inserts a newline at the cursor position",
        "The input box auto-expands to show the new line (up to the existing max height of 6 lines)",
        "Cursor moves to the beginning of the new line after insertion",
        "Pressing Enter (without modifiers) still submits the prompt",
        "If US-001 diagnosis shows Shift+Enter is not distinguishable, document this limitation in KEYBINDING-DIAGNOSIS.md and mark this story as passed with a note",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Depends on US-001 and US-002. If the terminal cannot distinguish Shift+Enter from Enter, this story is effectively a no-op (the config already has the binding, but the terminal doesn't send the modifier). In that case, document the limitation and pass."
    },
    {
      "id": "US-004",
      "title": "Ensure Ctrl+J works as universal newline shortcut",
      "description": "As a user, I want Ctrl+J to always insert a newline regardless of terminal type, so that I have a reliable multiline input method.",
      "acceptanceCriteria": [
        "Ctrl+J inserts a newline character at the cursor position in the TUI input box",
        "Behavior is identical to any other newline shortcut (expands input box, moves cursor to new line)",
        "Ctrl+J does not conflict with any other TUI functionality",
        "If Ctrl+J already works due to existing config defaults, verify and document it",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Ctrl+J sends ASCII 0x0A (linefeed) which all terminals support. The config already has ctrl+j in input_newline defaults. This story verifies it actually works end-to-end."
    },
    {
      "id": "US-005",
      "title": "Verify user-customizable submit and newline keybindings",
      "description": "As a user, I want to customize which keys trigger submit vs newline via the config file, so that I can match my preferred workflow.",
      "acceptanceCriteria": [
        "Setting keybinds.input_submit in opencode.jsonc config changes the submit key in the TUI textarea",
        "Setting keybinds.input_newline in opencode.jsonc config changes the newline key(s) in the TUI textarea",
        "Setting keybinds.input_newline to 'none' disables all newline insertion shortcuts",
        "Missing or invalid config values fall back to defaults (input_submit='return', input_newline='shift+return,ctrl+return,alt+return,ctrl+j')",
        "Add a unit test verifying config override behavior in packages/opencode/test/tui/textarea-keybindings.test.ts",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": "The config system already supports this via keybinds config in config.ts. This story verifies the full flow from config -> textarea keybindings."
    }
  ]
}
